Repository: goldpulpy/TelegramMusicBot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

# language_choose
source: ğŸŒ Choose language:
ru: 🌎 Выберите язык:

# language_command
source: ğŸŒ Change language
ru: 🌎 Изменить язык

# language_button
source: ğŸŒ Language
ru: 🌎 Язык

# menu
source: â­ï¸ <b>Menu</b>
ru: ⭐️ <b>Меню</b>

# menu_command
source: â­ï¸ Open menu
ru: ⭐️ Открыть меню

# faq_button
source: â“ FAQ
ru: ❓ FAQ

# faq
source: <b>â“ Frequently asked questions</b> <b>How to search for songs â“</b> â€¢ Type the song name or artist name in the chat. <b>How to open the menu â“</b> â€¢ Send me the /menu command in the chat. <b>How to save to your phone â“</b> â€¢ Select the desired song and save it to your phone. <b>Why is the ğŸ”½ button in the song listâ“</b> â€¢ Allows you to get all songs from the current page. <b>How to change the language â“</b> â€¢ Send me the /language command in the chat or click the Â«ğŸŒ LanguageÂ» button in the menu.
ru: <b>❓ Часто задаваемые вопросы</b> <b>Как искать песни ❓</b> • Напишите название песни или имя исполнителя в чат. <b>Как вызвать меню ❓</b> • Отправьте мне команду /menu в чат. <b>Как сохранить на телефон ❓</b> • Выделите нужную песню и сохраните её на телефон. <b>Зачем нужна кнопка 🔽 в списке песен❓</b> • Позволяет получить все песни с текущей страницы. <b>Как изменить язык ❓</b> • Отправьте мне команду /language в чат или нажмите на кнопку «🌎 Язык» в меню.

# top_hits_button
source: ğŸ”¥ Top
ru: 🔥 Топ песен

# top_hits
source: <b>ğŸ”¥ Popular music</b>
ru: <b>🔥 Популярная музыка</b>

# searching
source: ğŸ” Searching: <b>{keyword}</b>
ru: 🔍 Поиск: <b>{keyword}</b>

# search_result
source: ğŸ§ <b>{keyword}</b>:
ru: 🎧 <b>{keyword}</b>

# track_sending
source: ğŸ§ Sending track...
ru: 🎧 Отправка трека...

# search_query_error
source: âŒ Incorrect search query.
ru: ❌ Некорректный поисковый запрос.

# send_track_error
source: âŒ Oops! Something went wrong. Audio file is not available.
ru: ❌ Ой! Что-то пошло не так. Аудиофайл не доступен.

# promo_caption
source: <a href='https://t.me/{username}'>ğŸµ Discover More Music</a>
ru: <a href='https://t.me/{username}'>🎵 Найди больше музыки</a>

# back_button
source: â¬…ï¸ Back
ru: ⬅️ Назад

# not_subscribed
source: â—ï¸ To use the bot, you need to subscribe to the channels.
ru: ❗️ Для использования бота необходимо подписаться на каналы.

# sub_check_button
source: âœ… I'm subscribed
ru: ✅ Я подписан

# cannot_edit_message
source: âŒ Failed to edit message.
ru: ❌ Не удалось отредактировать сообщение.

# cannot_send_message
source: âŒ Failed to send message.
ru: ❌ Не удалось отправить сообщение.

# invalid_data
source: âŒ Invalid data.
ru: ❌ Некорректные данные.

# cannot_access_chat
source: âŒ Failed to access chat.
ru: ❌ Не удалось получить доступ к чату.

# error_occurred
source: âŒ Error occurred.
ru: ❌ Произошла ошибка.
